/* 浙工大转专业机考真题 题3 — 13的倍数判定（截尾倍比法）

题目描述
若将一个整数的个位数字截去，再用余下的数加上原个位数的4倍，如果和是13的倍数，
则原数能被13整除。现在我们要用计算机来实现这个判断策略。

如判断16354能够被13整除：
1635 + 4*4 = 1651
165 + 1*4 = 169
16 + 9*4 = 52
5 + 2*4 = 13

输入
输入多个整数。

输出
对于每个输入值，输出转换后的结果序列，一直到最后结果是13,26,39之一
或者是20以内非13的值为止。每个转换序列一行，行末回车，
若结果为13的倍数则输出yes，否则输出no。

整数范围不超过int

样例
输入：
16354

输出：
16354,1651,169,52,13 yes

*/
#include <stdio.h>
void is_13_times(int n) {
    printf("%d", n);
    while (n != 13 && n != 26 && n != 39 && !(n <= 20 && n != 13)) {
        // 取个位数
        int last_n = n % 10;
        // 取余下的数
        int front_n = n / 10;

        n = front_n + 4 * last_n;
        printf(" %d", n);
    }
    if (n % 13 == 0) printf(" yes");
    else printf(" no");
    printf("\n");
}

int main(void) {
    int n;
    while (scanf("%d", &n) != EOF) {
        is_13_times(n);
    }

    return 0;
}
